; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l10-t1-p2---int100n150-m25---int100c150---s93---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level9 level9)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level0 level24 level24)
(sum level1 level1 level2)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level9 level10)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level1 level24 level25)
(sum level2 level1 level3)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level9 level11)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level2 level24 level26)
(sum level3 level1 level4)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level9 level12)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level3 level24 level27)
(sum level4 level1 level5)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level9 level13)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level4 level24 level28)
(sum level5 level1 level6)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level9 level14)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level5 level24 level29)
(sum level6 level1 level7)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level9 level15)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level6 level24 level30)
(sum level7 level1 level8)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level9 level16)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level7 level24 level31)
(sum level8 level1 level9)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level9 level17)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level8 level24 level32)
(sum level9 level1 level10)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level9 level18)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level9 level24 level33)
(sum level10 level1 level11)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level9 level19)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level10 level24 level34)
(sum level11 level1 level12)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level9 level20)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level11 level24 level35)
(sum level12 level1 level13)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level9 level21)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level12 level24 level36)
(sum level13 level1 level14)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level9 level22)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level21 level34)
(sum level13 level22 level35)
(sum level13 level24 level37)
(sum level14 level1 level15)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level9 level23)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level21 level35)
(sum level14 level22 level36)
(sum level14 level24 level38)
(sum level15 level1 level16)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level9 level24)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level21 level36)
(sum level15 level22 level37)
(sum level15 level24 level39)
(sum level16 level1 level17)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level9 level25)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level21 level37)
(sum level16 level22 level38)
(sum level16 level24 level40)
(sum level17 level1 level18)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level9 level26)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level21 level38)
(sum level17 level22 level39)
(sum level17 level24 level41)
(sum level18 level1 level19)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level9 level27)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level21 level39)
(sum level18 level22 level40)
(sum level18 level24 level42)
(sum level19 level1 level20)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level9 level28)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level21 level40)
(sum level19 level22 level41)
(sum level19 level24 level43)
(sum level20 level1 level21)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level9 level29)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level21 level41)
(sum level20 level22 level42)
(sum level20 level24 level44)
(sum level21 level1 level22)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level9 level30)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level21 level42)
(sum level21 level22 level43)
(sum level21 level24 level45)
(sum level22 level1 level23)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level9 level31)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level21 level43)
(sum level22 level22 level44)
(sum level22 level24 level46)
(sum level23 level1 level24)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level9 level32)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level21 level44)
(sum level23 level22 level45)
(sum level23 level24 level47)
(sum level24 level1 level25)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level9 level33)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level21 level45)
(sum level24 level22 level46)
(sum level24 level24 level48)
(sum level25 level1 level26)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level9 level34)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level21 level46)
(sum level25 level22 level47)
(sum level25 level24 level49)
(sum level26 level1 level27)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level9 level35)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level21 level47)
(sum level26 level22 level48)
(sum level26 level24 level50)
(sum level27 level1 level28)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level9 level36)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level21 level48)
(sum level27 level22 level49)
(sum level27 level24 level51)
(sum level28 level1 level29)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level9 level37)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level21 level49)
(sum level28 level22 level50)
(sum level28 level24 level52)
(sum level29 level1 level30)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level9 level38)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level21 level50)
(sum level29 level22 level51)
(sum level29 level24 level53)
(sum level30 level1 level31)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level9 level39)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level21 level51)
(sum level30 level22 level52)
(sum level30 level24 level54)
(sum level31 level1 level32)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level9 level40)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level21 level52)
(sum level31 level22 level53)
(sum level31 level24 level55)
(sum level32 level1 level33)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level9 level41)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level21 level53)
(sum level32 level22 level54)
(sum level32 level24 level56)
(sum level33 level1 level34)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level9 level42)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level21 level54)
(sum level33 level22 level55)
(sum level33 level24 level57)
(sum level34 level1 level35)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level9 level43)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level21 level55)
(sum level34 level22 level56)
(sum level34 level24 level58)
(sum level35 level1 level36)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level9 level44)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level21 level56)
(sum level35 level22 level57)
(sum level35 level24 level59)
(sum level36 level1 level37)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level9 level45)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level21 level57)
(sum level36 level22 level58)
(sum level36 level24 level60)
(sum level37 level1 level38)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level9 level46)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level21 level58)
(sum level37 level22 level59)
(sum level38 level1 level39)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level9 level47)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level21 level59)
(sum level38 level22 level60)
(sum level39 level1 level40)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level9 level48)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level21 level60)
(sum level40 level1 level41)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level9 level49)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level41 level1 level42)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level9 level50)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level42 level1 level43)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level9 level51)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level43 level1 level44)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level9 level52)
(sum level43 level17 level60)
(sum level44 level1 level45)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level9 level53)
(sum level45 level1 level46)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level9 level54)
(sum level46 level1 level47)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level9 level55)
(sum level47 level1 level48)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level9 level56)
(sum level48 level1 level49)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level9 level57)
(sum level49 level1 level50)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level9 level58)
(sum level50 level1 level51)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level9 level59)
(sum level51 level1 level52)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level9 level60)
(sum level52 level1 level53)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level53 level1 level54)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level54 level1 level55)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level55 level1 level56)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level56 level1 level57)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level57 level1 level58)
(sum level57 level3 level60)
(sum level58 level1 level59)
(sum level59 level1 level60)

(connected l0 l4)
(fuelcost level6 l0 l4)
(connected l0 l5)
(fuelcost level7 l0 l5)
(connected l1 l3)
(fuelcost level24 l1 l3)
(connected l1 l8)
(fuelcost level17 l1 l8)
(connected l2 l3)
(fuelcost level6 l2 l3)
(connected l2 l8)
(fuelcost level18 l2 l8)
(connected l2 l9)
(fuelcost level17 l2 l9)
(connected l3 l1)
(fuelcost level24 l3 l1)
(connected l3 l2)
(fuelcost level6 l3 l2)
(connected l3 l5)
(fuelcost level1 l3 l5)
(connected l4 l0)
(fuelcost level6 l4 l0)
(connected l4 l5)
(fuelcost level9 l4 l5)
(connected l4 l8)
(fuelcost level4 l4 l8)
(connected l4 l9)
(fuelcost level22 l4 l9)
(connected l5 l0)
(fuelcost level7 l5 l0)
(connected l5 l3)
(fuelcost level1 l5 l3)
(connected l5 l4)
(fuelcost level9 l5 l4)
(connected l5 l6)
(fuelcost level5 l5 l6)
(connected l6 l5)
(fuelcost level5 l6 l5)
(connected l6 l7)
(fuelcost level21 l6 l7)
(connected l6 l9)
(fuelcost level3 l6 l9)
(connected l7 l6)
(fuelcost level21 l7 l6)
(connected l7 l9)
(fuelcost level21 l7 l9)
(connected l8 l1)
(fuelcost level17 l8 l1)
(connected l8 l2)
(fuelcost level18 l8 l2)
(connected l8 l4)
(fuelcost level4 l8 l4)
(connected l9 l2)
(fuelcost level17 l9 l2)
(connected l9 l4)
(fuelcost level22 l9 l4)
(connected l9 l6)
(fuelcost level3 l9 l6)
(connected l9 l7)
(fuelcost level21 l9 l7)

(at t0 l6)
(fuel t0 level60)
(= (total-cost) 0)

(at p0 l8)
(at p1 l3)
)

(:goal
(and
(at p0 l4)
(at p1 l9)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l6 l5 level55 level5 level60)
   deleted: (at t0 l6) (fuel t0 level60)
   added: (at t0 l5) (fuel t0 level55)
   goals met: 0 of 2
2. (drive t0 l5 l3 level54 level1 level55)
   deleted: (at t0 l5) (fuel t0 level55)
   added: (at t0 l3) (fuel t0 level54)
   goals met: 0 of 2
3. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 2
4. (drive t0 l3 l2 level48 level6 level54)
   deleted: (at t0 l3) (fuel t0 level54)
   added: (at t0 l2) (fuel t0 level48)
   goals met: 0 of 2
5. (drive t0 l2 l8 level30 level18 level48)
   deleted: (at t0 l2) (fuel t0 level48)
   added: (at t0 l8) (fuel t0 level30)
   goals met: 0 of 2
6. (load p0 t0 l8)
   deleted: (at p0 l8)
   added: (in p0 t0)
   goals met: 0 of 2
7. (drive t0 l8 l4 level26 level4 level30)
   deleted: (at t0 l8) (fuel t0 level30)
   added: (at t0 l4) (fuel t0 level26)
   goals met: 0 of 2
8. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 1 of 2
9. (drive t0 l4 l9 level4 level22 level26)
   deleted: (at t0 l4) (fuel t0 level26)
   added: (at t0 l9) (fuel t0 level4)
   goals met: 1 of 2
10. (unload p1 t0 l9)
   deleted: (in p1 t0)
   added: (at p1 l9)
   goals met: 2 of 2
